<template>
  <div class="about-school-now">
    <div class="about-school-now__carousel">
      <about-school-now-carousel/>
    </div>
      <div class="about-school-now__card-wrapper">
        <div class="about-school-now__card">
          <p class="about-school-now__text"><span> Загальноосвітня школа №23 — це заклад, у якому поглиблено вивчається математика та українська мова і багато уваги приділяється естетичному розвитку учнів. Школа пишається своїми традиціями і водночас дивиться в майбутнє.</span>
            <span>Головною метою освіти сучасної людини є здобуття знань на високому рівні. Школа №23 надає обдарованим дітям можливість реалізувати свої індивідуальні творчі здібності, оволодіти навичками наукової роботи, знаннями етики, художньої культури, опанування іноземними мовами, комп’ютерною технікою та продовжити відповідну освіту у вищій школі. Основним завданням школи є виховання морально і фізично здорової дитини, розвиток її природних здібностей, формування творчої особистості, самосвідомості на основі практичних занять, пізнання себе, суспільства.</span>
            <span>Школа I - III ступенів передбачає пізнання учнями оточуючого середовища, себе, свого здоров’я, формування необхідного самоаналізу, творчості, мотивації досягнення цілей, виховання активності, ініціативності, наполегливості, надання якісної середньої освіти, зорієнтованої на здібних дітей, виховання творчо обдарованої людини, яка проявить себе в тій чи іншій сфері діяльності.</span>
            <span>У школі працюють 33 досвідчених педагога, які є справжніми майстрами своєї справи. Працює методична рада, 9 методичних об'єднань, 4 творчі групи. Методична рада школи працює таким чином, щоб охопити всі ланки навчально-виховного процесу, сприяє розвитку творчого потенціалу педагога, надає методичну підтримку молодим вчителям. Вчителі школи постійно беруть участь в конкурсах "Учитель року" і "Класний керівник року". Досвід багатьох вчителів школи став надбанням педагогічних колективів міста і області.</span>
            </p>
         </div>
      </div>
  </div>

</template>
<script>
import AboutSchoolNowCarousel from '@/components/about/components/AboutSchoolNowCarousel.vue';

export default {
  name: 'AboutSchoolNow',
  components: {
    AboutSchoolNowCarousel,
  }
}
</script>
<style lang="scss">
  .about-school-now {
    &__card-wrapper {
      @include flex-row(center, center);
    }
    &__card {
      width: 100%;
      box-shadow: $shadow;
      background-color: $N0;
      padding: 50px 40px 30px;
    }
    &__text {
      &>* {
        display: block;
        margin-bottom: 16px;
      }
    }
  }
</style>



